# # Task1 программа должна определять является ли имя, введенное пользователем корректным.
# # 1) Имя должно быть не меньше 3 букв
# # 2) Имя должно начинаться с заглавной буквы
# # Если одно из условий не удовлетворительно -  программа должна вернуть - False )
# def checkName(name):
#
# checkName("Maxim") # true
# checkName("maxim") #false
# checkName("Ma") #false
# #Task2
# #Программа должна проверять сосиски на то в каком они состоянии, а именно испорченны или нет
# #Срок годности сосисок 12 дней
# #Температура хранения от 4 до 6 градусов
# # Если одно из условий не удовлетворительно -  программа должна вернуть - False )
# def checkSausages(term,temperature):
# checkSausages(10, 10)#false
# checkSausages(16, 5)#false
# checkSausages(10, 5)#true
