# depo = int(input("Введите размер депозита: "))# целое число - бонусы, таймер , колличество монет , колличество врагов
# procent = float(input("Введите процентную ставку: "))# дробное число - 150см
# timeDepo = int(input("Введите срок, лет: "))
# depo = depo+(procent/100)*depo#1
# depo = depo+(procent/100)*depo#2
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo
# depo = depo+(procent/100)*depo#15
# print(depo)
# print(pow(2,3))
# S - итог
# S0 - сумма вклада
# P - процентная ставка
# n - срок

# procent1 = int(input("Введите колличество процентов "))
# length1 = float(input("Введите длинну первой кости в сантиметрах"))
# lengthPeople1 = (length1 / procent1) * 100
# procent2 = int(input("Введите колличество процентов "))
# length2 = float(input("Введите длинну второй кости в сантиметрах"))
# lengthPeople2 = (length2 / procent2) * 100
# print(lengthPeople1, lengthPeople2)
# print(lengthPeople2 == lengthPeople1)
# if lengthPeople1 == lengthPeople2:
#     print("это один и тот же человек")
# else:
#     print("эти кости 2-ух разных людей")
# Написать программу которая должна подсказывать - можно ли будет купить себе мобильный телефон, если вводится сумма, которая меньше стоимости телефона - программа выводит - НЕЛЬЗЯ, иначе - МОЖНОm
m = int(input("Сколько у вас денег? "))
t = int(input("Сколько стоит телефон? "))
if m<t:
    print("Нельзя купить телефон ")
else:
    print("Можно купить телефон")
#
#
#
#
#
#
#
#
#
#
#
##
#
#
#
#
##
#
#
#
#
##
#
#
#
#
#